{
  "intents": [
    {
      "tag": "dry_skin",
      "patterns": [
        "My skin is dry and flaky",
        "Dry patches on my face",
        "How to treat dry skin?",
        "What helps with dry facial skin?",
        "Face feels tight and dry",
        "My skin feels rough",
        "How can I hydrate dry skin?",
        "Moisturizer for dry patches",
        "Skin dryness in winter",
        "How to prevent dry skin?",
        "Face gets dry after washing",
        "Best routine for dry skin?",
        "Dry skin on my cheeks",
        "My skin feels like paper",
        "What causes dry skin?",
        "How do I fix dry skin?",
        "Dry skin around my mouth",
        "I need help with dry skin",
        "What is the best moisturizer for dry skin?",
        "How to treat flaky skin on my face?",
        "Is my skin too dry?",
        "What foods help with dry skin?",
        "Should I exfoliate dry skin?",
        "How to get rid of dry patches on my face?",
        "Dry skin on my forehead",
        "How to reduce tightness in my face?",
        "My skin is parched",
        "Should I use oils for dry skin?",
        "How often should I moisturize dry skin?",
        "I have cracked skin, what should I do?",
        "What serum works for dry skin?",
        "Dry skin under my eyes",
        "How do I stop skin from peeling?",
        "Dryness on my nose",
        "What are the best masks for dry skin?",
        "My skin feels tight after washing",
        "My hands are dry too",
        "What soap is best for dry skin?",
        "Can my diet help with dry skin?",
        "Does cold weather make dry skin worse?",
        "I need a hydrating cream for my face",
        "Why is my skin always dry in winter?",
        "How to get rid of dry skin on my legs?",
        "My lips are chapped and dry",
        "What to do for dry skin around eyes?",
        "What moisturizer is best for winter dry skin?",
        "My skin flakes after cleansing",
        "Should I use warm or cold water for dry skin?",
        "How to reduce dry skin sensitivity?",
        "Dry patches after makeup",
        "Can dry skin lead to wrinkles?",
        "How to protect dry skin in the sun?",
        "Best way to hydrate skin at night",
        "Dry skin after swimming",
        "What skincare routine is best for dry skin?",
        "My skin feels dehydrated all the time",
        "How do I treat dry skin and acne?",
        "What is the best facial oil for dry skin?",
        "Does drinking water help dry skin?",
        "Dry patches on elbows and knees",
        "What sunscreen is best for dry skin?",
        "Why does my skin get dry after I shower?",
        "Dry skin around my mouth and chin",
        "How to prevent dry hands in winter?",
        "I need a facial moisturizer",
        "How to stop dry skin from peeling?",
        "Dry skin on my scalp",
        "How to treat dry skin on neck",
        "Dry face after exercise",
        "Can I use coconut oil for dry skin?",
        "What foods should I eat for dry skin?",
        "How to make dry skin look healthy?",
        "How to exfoliate dry skin gently?",
        "How to deal with dry skin after chemical peel?",
        "How to fix dry patches on skin naturally?",
        "Best night cream for dry skin",
        "How to improve dry skin texture",
        "Dry skin under my eyebrows",
        "What can I use to moisturize my dry skin?",
        "How to hydrate skin quickly?",
        "What’s causing my skin to dry out?",
        "How to treat dry skin on my feet",
        "Best cleanser for dry skin"
      ],
      "responses": [
        "Use a rich moisturizer with hyaluronic acid and avoid hot water."
      ]
    },

    {
      "tag": "oily_skin",
      "patterns": [
        "My skin is very oily",
        "How to reduce oily shine?",
        "Face gets greasy quickly",
        "Tips for oily skin?",
        "Best routine for oily face",
        "What causes oily skin?",
        "How to keep my face matte?",
        "My T-zone is very oily",
        "What is the best cleanser for oily skin?",
        "How can I stop oily skin?",
        "Oily skin makes my makeup melt",
        "How to control oil on face?",
        "Can oily skin cause acne?",
        "I have large pores due to oily skin",
        "What can I do to balance oily skin?",
        "How to stop oil buildup on my face?",
        "Why does my skin produce so much oil?",
        "How often should I wash my face if it's oily?",
        "Best face mask for oily skin",
        "What are the best oils for oily skin?",
        "Should I use a toner for oily skin?",
        "How do I prevent oily skin after washing?",
        "How to manage excess oil on my skin?",
        "Best products for oily skin care",
        "Does oily skin mean I’m over-moisturizing?",
        "What’s the best treatment for oily skin?",
        "Can I use a moisturizer on oily skin?",
        "How to avoid a greasy face?",
        "What foods help reduce oily skin?",
        "My skin gets oily throughout the day",
        "How to deal with greasy skin?",
        "How to remove shine from oily face?",
        "Should I use an exfoliator for oily skin?",
        "How do I make my face less oily?",
        "Best sunscreen for oily skin",
        "Should I use a clay mask for oily skin?",
        "How do I treat oily skin naturally?",
        "Can oily skin age slower?",
        "How can I minimize large pores on oily skin?",
        "Does oily skin ever get dry?",
        "Best facial mist for oily skin",
        "What’s the best primer for oily skin?",
        "How to stop oily skin in the summer?",
        "Can oily skin cause blackheads?",
        "How do I get rid of acne caused by oily skin?",
        "What face wash works best for oily skin?",
        "How to treat oily skin in humid weather?",
        "Oily skin with acne – what should I do?",
        "My skin is oily but sensitive",
        "Best moisturizer for oily acne-prone skin",
        "How to reduce shine on face without makeup?",
        "How do I avoid clogged pores with oily skin?",
        "What is the best skincare routine for oily skin?",
        "Does oily skin need a special moisturizer?",
        "Can I use oil on oily skin?",
        "What’s the best SPF for oily skin?",
        "How can I avoid greasy skin with makeup?",
        "Best soap for oily skin",
        "How do I stop oily skin during the night?",
        "How can I reduce oily skin in my nose?",
        "Oily skin with hormonal acne – what to do?",
        "What’s the difference between oily skin and combination skin?",
        "How do I prevent oily skin from getting worse?",
        "Does oily skin make you age faster?",
        "How to stop my skin from looking shiny?",
        "What toner works best for oily skin?",
        "Oily skin in the morning – what to do?",
        "How to handle oily skin on my face and neck?",
        "Best scrub for oily skin",
        "Can oily skin cause pimples?",
        "How do I make my oily skin less shiny?",
        "Can I use retinol with oily skin?",
        "How can I reduce my oily skin appearance?",
        "What’s the best treatment for an oily T-zone?",
        "Is oily skin better than dry skin?",
        "How to fix oily skin that’s also dehydrated?",
        "Oily skin and acne prevention tips",
        "Best makeup remover for oily skin",
        "How do I stop oil production on my face?",
        "Should I use a face oil if I have oily skin?",
        "What’s the best way to cleanse oily skin?",
        "How to treat oily skin with acne scars?"
      ],
      "responses": [
        "Cleanse twice daily with oil-free products and use a clay mask weekly."
      ]
    },
    {
      "tag": "acne",
      "patterns": [
        "How to get rid of acne?",
        "I have pimples on my face",
        "What causes breakouts?",
        "Remedy for acne scars?",
        "How to reduce zits?",
        "How to treat cystic acne?",
        "Best treatment for acne",
        "How do I get rid of pimples fast?",
        "Acne on my chin – what to do?",
        "What helps clear acne?",
        "How to stop acne from spreading?",
        "Can stress cause acne?",
        "What is the best face wash for acne?",
        "How to treat acne marks?",
        "How to prevent acne breakouts?",
        "What causes acne on my cheeks?",
        "How do I treat acne on my back?",
        "Acne treatment for sensitive skin",
        "Should I use tea tree oil for acne?",
        "How to get rid of blackheads?",
        "How do I stop acne scarring?",
        "Acne on forehead – what causes it?",
        "Best acne scar treatment",
        "How to prevent acne on my nose?",
        "Acne on my shoulders – how to treat it?",
        "How do I treat hormonal acne?",
        "What foods trigger acne?",
        "How to stop acne on my neck?",
        "Best serum for acne scars",
        "Can oily skin cause acne?",
        "What is the best routine for acne-prone skin?",
        "How to treat cystic acne naturally?",
        "Does acne go away with age?",
        "Acne on my jawline – why?",
        "How to reduce pimple size overnight?",
        "What is the best acne treatment for adults?",
        "Should I use a clay mask for acne?",
        "What’s the best sunscreen for acne-prone skin?",
        "How to treat acne scars with vitamin C?",
        "How to treat whiteheads?",
        "Does retinol help with acne?",
        "Acne treatment during pregnancy",
        "What is the best diet for acne-free skin?",
        "How to treat acne on the face?",
        "How to prevent acne after shaving?",
        "How to reduce pimples on my forehead?",
        "How to stop acne after using makeup?",
        "How to treat acne scars after popping pimples?",
        "What works best for cystic acne?",
        "Can acne be genetic?",
        "How do I get rid of acne overnight?",
        "Does drinking water help with acne?",
        "Best facial wash for acne-prone skin",
        "What is the best moisturizer for acne?",
        "How to treat acne with essential oils?",
        "How do I stop acne on my face?",
        "How long does it take to clear acne?",
        "What can I use for acne on my chest?",
        "How to treat acne under my skin?",
        "What helps acne disappear fast?",
        "How to treat back acne?",
        "How to reduce pimples on my nose?",
        "Should I use salicylic acid for acne?",
        "Acne on my chest – what should I do?",
        "How do I treat acne scars at home?",
        "How to prevent acne after facial?",
        "How to control acne flare-ups?",
        "How do I get rid of acne on my face naturally?",
        "Acne treatment for dry skin",
        "What to do for acne and oily skin?",
        "Best acne patch treatment",
        "How to stop acne after waxing?",
        "How do I stop acne on my back and chest?",
        "Can makeup cause acne?",
        "How to prevent acne from scarring?",
        "Best acne treatment for teenagers",
        "Does sun exposure cause acne?",
        "How to treat acne scars with Aloe Vera?",
        "How to avoid acne flare-ups?",
        "What to do if acne treatments aren’t working?",
        "How to avoid acne when traveling?",
        "How to treat acne without drying out my skin?",
        "Acne on the scalp – what should I do?",
        "How do I know if I have acne or something else?",
        "How to remove acne scars with lemon?",
        "Should I wash my face more often if I have acne?",
        "How to treat adult acne?",
        "Can I use benzoyl peroxide for acne?",
        "What should I avoid if I have acne?",
        "How to get rid of acne on my arms?",
        "How to treat blackheads on my nose?",
        "What is the best acne face mask?",
        "What is the best acne serum for oily skin?",
        "What’s the best treatment for acne scars?",
        "Can acne cause permanent scars?",
        "How to treat acne at home naturally?",
        "How to reduce acne in a week?"
      ],
      "responses": [
        "Use salicylic acid cleanser and avoid touching your face frequently."
      ]
    },

    {
      "tag": "sunscreen",
      "patterns": [
        "Do I need sunscreen every day?",
        "When should I use sunscreen?",
        "Why is sunscreen important?",
        "What sunscreen is best for my skin?",
        "Should I wear sunscreen if I’m indoors?",
        "How often should I apply sunscreen?",
        "Can sunscreen prevent aging?",
        "Does sunscreen protect against wrinkles?",
        "What SPF should I use for daily wear?",
        "Can sunscreen cause breakouts?",
        "How long does sunscreen last?",
        "Is sunscreen necessary in winter?",
        "Can sunscreen cause acne?",
        "How much sunscreen should I apply?",
        "Does sunscreen expire?",
        "How to apply sunscreen properly?",
        "What sunscreen is best for oily skin?",
        "What’s the difference between SPF 30 and SPF 50?",
        "Can I use sunscreen under makeup?",
        "Do I need sunscreen if I have dark skin?",
        "Can sunscreen help with hyperpigmentation?",
        "Should I use sunscreen if I’m not going outside?",
        "Can sunscreen prevent sunburn?",
        "What’s the best sunscreen for sensitive skin?",
        "Is it necessary to reapply sunscreen every two hours?",
        "Can sunscreen be used on the face and body?",
        "What happens if you don’t wear sunscreen?",
        "How to choose the right sunscreen for your skin type?",
        "Is mineral sunscreen better than chemical sunscreen?",
        "Can I use sunscreen on acne-prone skin?",
        "How to reapply sunscreen over makeup?",
        "Does sunscreen help with skin redness?",
        "Can sunscreen be used on children?",
        "How do I know if my sunscreen is working?",
        "Is sunscreen required on cloudy days?",
        "Can sunscreen protect against UVA and UVB rays?",
        "Should I wear sunscreen on cloudy or rainy days?",
        "What’s the best sunscreen for dry skin?",
        "How long before going outside should I apply sunscreen?",
        "Does sunscreen prevent skin cancer?",
        "Can I use sunscreen on my lips?",
        "Can sunscreen help prevent dark spots?",
        "Should I use a higher SPF for longer sun exposure?",
        "How do I apply sunscreen on my body?",
        "What’s the difference between physical and chemical sunscreen?",
        "Can sunscreen clog pores?",
        "What sunscreen is best for acne-prone skin?",
        "Does sunscreen prevent sunburns on dark skin?",
        "How to protect your skin from sun damage?",
        "Is sunscreen important for preventing skin cancer?",
        "How to choose sunscreen for oily skin?",
        "What is the best sunscreen for sensitive skin around eyes?",
        "How to protect my skin in the sun?",
        "Can I wear sunscreen on my tattoos?",
        "How often should I reapply sunscreen while swimming?",
        "Does sunscreen prevent pigmentation?",
        "What’s the best sunscreen for combination skin?",
        "How to apply sunscreen to my face properly?",
        "Can sunscreen block vitamin D production?",
        "What sunscreen should I wear on my face?",
        "How much sunscreen do I need for my body?",
        "Does sunscreen protect against skin damage?",
        "How do I find the right sunscreen for my skin type?",
        "Can sunscreen protect against sunburns?",
        "Should I use sunscreen with makeup?",
        "What SPF sunscreen is good for everyday use?",
        "Can sunscreen prevent skin from aging?",
        "How to apply sunscreen on my face and neck?",
        "What sunscreen should I use if I have oily skin?",
        "Is sunscreen needed when it's overcast?",
        "How do I reapply sunscreen at the beach?",
        "Can sunscreen be applied over moisturizer?",
        "How does sunscreen protect the skin from UV rays?",
        "What are the best sunscreens for dry skin?",
        "What happens if I don’t use sunscreen every day?",
        "Should I wear sunscreen when it’s cloudy?",
        "What’s the best sunscreen for my face?",
        "Can sunscreen make my skin break out?",
        "Can I use sunscreen on my scalp?",
        "How do I protect my skin from the sun without sunscreen?",
        "Should I use a different sunscreen for my face and body?",
        "How long does sunscreen last after application?",
        "What sunscreen should I use for sensitive skin?",
        "Does sunscreen prevent pigmentation or dark spots?",
        "How does sunscreen work to protect my skin?",
        "How do I choose the best sunscreen for my skin?",
        "How do I protect my lips from the sun?"
      ],
      "responses": [
        "Apply sunscreen every morning, even on cloudy days, to prevent UV damage."
      ]
    },
    {
      "tag": "home_remedy",
      "patterns": [
        "What are some home remedies for glowing skin?",
        "Best home remedy for clear skin?",
        "How to treat acne with home remedies?",
        "Any natural ways to reduce pimples?",
        "How to get smooth skin naturally?",
        "Home remedy for dry skin?",
        "What home remedies help with oily skin?",
        "Can I use honey for my skin?",
        "How to use aloe vera for skin problems?",
        "Natural treatment for blackheads?",
        "Home remedy for dark spots?",
        "How to lighten skin naturally?",
        "Home remedies for skin whitening?",
        "Best DIY face mask for acne?",
        "How to reduce wrinkles naturally?",
        "What natural ingredients help with skin care?",
        "Can I use lemon for my face?",
        "How to use turmeric for better skin?",
        "How to make a natural scrub at home?",
        "Can coconut oil help my skin?"
      ],
      "responses": [
        "You can try natural remedies like honey masks for hydration, aloe vera for soothing, and turmeric for brightening. Always do a patch test first to avoid irritation."
      ]
    }
  ]
}
